{
  "Harry Potter": {
    "sloan": "RLUEN",
    "tagline": "Reactive, emotion-driven, flexible",
    "points": [
      "Morally reactive",
      "expression is defined by moral immediacy, reacts emotionally to injustice and threats.",
      "Acts when emotionally compelled and not strategically motivated.",
      "Doesn't seek leadership, but steps forward because he feels the need to.",
      "His emotional reactivity fuels bravery rather than hesitation, but the underlying structure is still reactive, not agentic",
      "emotional sensitivity manifests as instinctive heroism.",
      "His high Reserved (R) score reflects a character who rarely initiates grand social acts; things happen to him.",
      "His Extreme Limbic (L) score is reflected in his dialogue.",
      "He is frequently angry, frustrated, or grieving and his words reflect the weight of his trauma."
    ]
  },
  "Hermione Granger": {
    "sloan": "RLUEN",
    "tagline": "Reactive, emotion-driven, flexible",
    "points": [
      "Cognitive reactive",
      "Reacts to uncertainty by gathering information",
      "Emotional stress triggers rule-seeking and preparation",
      "appears organized, but her organization is reactive",
      "When order ceases, she becomes anxious rather than assertive, reinforcing the RLUEN profile.",
      "Her high Limbic (L) score captures her high-strung nature and her anxiety about getting expelled or failing a test",
      "Internally structured, used as a coping mechanism.",
      "She organizes to reduce uncertainty, not to control outcomes.",
      "though considered the \"smart one\", her movie dialogue is just as reactive to the plot as Harry and Ron's"
    ]
  },
  "Ron Weasley": {
    "sloan": "RLUEN",
    "tagline": "Reactive, emotion-driven, flexible",
    "points": [
      "Relational reactivity",
      "His high Limbic (L) score reflects how he wears his heart on his sleeve, whether it's fear of spiders, jealousy of Harry, or excitement.",
      "He is the most transparent character in the films.",
      "His high Egocentric (E) score isn't about being selfish but about his focus on his own immediate reality (hunger, discomfort, family status etc.)",
      "Emotional stress can manifest as jealousy, defensiveness, or withdrawal",
      "Emotional loyalty rather than principled",
      "Perceived social standing may shape his decisions",
      "emotional volatility can be seen as more interpersonal than moral or cognitive.",
      "emotional reactivity manifests as insecurity-driven behavior."
    ]
  },
  "Draco Malfoy": {
    "sloan": "RLUEN",
    "tagline": "Reactive, emotion-driven, flexible",
    "points": [
      "Fear-driven emotional reactivity",
      "His behavior is shaped by expectation and pressure",
      "Emotional stress produces avoidance and hesitation",
      "May seem ideological but collapses under pressure because his personality lacks emotional regulation and internal stability",
      "His reactions expose anxiety rather than conviction",
      "emotional reactivity shows as defensive hostility"
    ]
  },
  "Remus Lupin": {
    "sloan": "SCoAI",
    "tagline": "Agentic, steady",
    "points": [
      "uses his intellect to connect with others (specifically Harry)",
      "Sophisticated dialogue and the only other character with same SLOAN code as Dumbledore",
      "May possess the same intellect as other highly viewed characters like but his moderate organized (o) score makes him feel more approachable and flexible than other authority figures.",
      "His high Calm (C) and Accommodating (A) scores reflect his role as the empathetic mentor who remains composed despite events or discussions of his past"
    ]
  },
  "Alastor Moody": {
    "sloan": "rluen",
    "tagline": "Reactive, steady",
    "points": [
      "profile is defined by a single extreme: Egocentric (E), which doesn't mean \"selfish\", but uncompromising",
      "Pragmatist by nature, who's objective overrides manners occasionally",
      "Moderate scores in everything else reflect a seasoned veteran",
      "Disciplined and functional control over his speech unlike other characters with more extreme scores resulting in emotional outbursts"
    ]
  },
  "Gilderoy Lockhart": {
    "sloan": "rCoen",
    "tagline": "Reactive, steady",
    "points": [
      "Moderate Reserved, Extreme Calm, Moderate Organized, Moderate Egocentric, Moderate Non-curious",
      "He speaks confidently but avoids responsibility",
      "Planning is superficial and short-lived",
      "He does not experience anxiety when exposed",
      "Failure does not destabilize his self-image.",
      "He rationalizes instead of reflect",
      "His only extreme is Calm (C).",
      "In the movies, this represents his delusion.",
      "He is never rattled or anxious because he is entirely encapsulated by his own vanity"
    ]
  },
  "Minerva McGonagall": {
    "sloan": "scoAI",
    "tagline": "Agentic, steady",
    "points": [
      "Moderate Social, Moderate Calm, Moderate Organized, high Accommodating, high Inquisitive",
      "Her SLOAN code highlight her role as an academic authority who is deeply committed to the social order of Hogwarts",
      "Due to her Social, Calm, and Organized scores being moderate (sco), she feels more \"human\" and grounded than her contemporaries like Dumbledore or Snape",
      "She enforces rules even when emotionally costly.",
      "Maintains authority without emotional escalation",
      "For her, structure is not situational, it is identity-based.",
      "A notable difference to someone like Hermione who organizes to feel safe; McGonagall organizes because it is necessary.",
      "Stress does not destabilize her language or behavior"
    ]
  },
  "Lucius Malfoy": {
    "sloan": "ScOAI",
    "tagline": "Agentic, steady, structured",
    "points": [
      "Extreme Social, Moderate Calm, Extreme Organized, Extreme Accommodating, Extreme Inquisitive",
      "structured behavior can be attributed to external systems, not internal conviction",
      "His discipline is strongest when status protects him.",
      "Composure relies on external backing",
      "Unlike Voldemort or Snape, Lucius has a moderate calm (c).",
      "This matches his arc in the films, where he starts as a cold, unshakeable figure.",
      "As he starts to lose favor with Voldemort, his composure begins to falter.",
      "The lowercase \"c\" captures that underlying desperation and fear that eventually peeks through his once polished exterior",
      "*NOTE* A difference between him and McGonagall is she enforces structure regardless of power while Lucius relies on structure to preserve power.",
      "McGonagall is the system; Lucius hides behind it."
    ]
  },
  "Bellatrix Lestrange": {
    "sloan": "SCOAI",
    "tagline": "Agentic, steady, structured",
    "points": [
      "high Social, high Calm, high Organized, high Accommodating, high Inquisitive.",
      "It may seem counter-intuitive that a \"mad\" character has an Extreme Calm (C) and Organized (O) score, but in the movies, she is never truly rattled.",
      "She is fearless.",
      "Her dialogue is not reactive or anxious; it is predatory.",
      "She does not hesitate, doubt, or second-guess; her actions flow directly from conviction.",
      "Extreme Social (S) impact is noticeable when present on the screen.",
      "Her Extreme Accommodating (A) trait is linked to her devotion to Voldemort; she is \"accommodating\" to his will above all else",
      "*NOTE* a difference between her and Snape.",
      "Where Snape controls emotion to preserve secrecy, Bellatrix unleashes emotion to demonstrate loyalty.",
      "Both act from belief, but Bellatrix's personality externalizes that belief through visible passion and aggression."
    ]
  },
  "Sirius Black": {
    "sloan": "sluai",
    "tagline": "Agentic, steady",
    "points": [
      "While he sits in the Cluster 2 , the cluster mostly extreme scores, his movie dialogue is unique because it doesn't contain any.",
      "This makes him one of the most grounded and characters among his tier.",
      "Acts as the bridge between the high-stakes war of the adults and the emotional needs of Harry.",
      "His dialogue is animated, impulsive, and emotionally charged, revealing a character who acts from deeply felt conviction rather than planning or restraint.",
      "This is the reason he belongs in this cluster; not because he is controlled or strategic, but because he acts from internal conviction, not situational pressure.",
      "His medium SLOAN scores reflect a someone who has been through extreme trauma but has come out the other side with a tempered, realistic perspective",
      "Personality is driven by emotional conviction and loyalty, giving him agency without discipline and courage without restraint.",
      "*NOTE* difference between him and Harry- Harry reacts because he must while Sirius acts because he believes"
    ]
  },
  "Severus Snape": {
    "sloan": "SCOAI",
    "tagline": "Agentic, steady, structured",
    "points": [
      "Personality is defined by extreme internal discipline and emotional suppression",
      "While sharing the same code as Voldemort, Snape uses these traits for concealment",
      "Dialogue in the films is minimal, controlled, and precise, reflecting a character who does not externalize emotion but instead channels it into sustained internal commitment",
      "Unlike reactive characters, Snape does not respond impulsively to events; his actions are guided by long-term intent, even when those actions appear cruel or detached",
      "What distinguishes Snape within the SCOAI structure is restraint.",
      "His agency is quiet rather than demonstrative.",
      "He exercises power through consistency and endurance rather than dominance or charisma, maintaining composure under prolonged emotional strain.",
      "This makes his influence subtle but persistent",
      "His personality is built to sustain secrecy, duty, and delayed outcomes"
    ]
  },
  "Voldemort": {
    "sloan": "SCOAI",
    "tagline": "Agentic, steady, structured",
    "points": [
      "Voldemort represents the most rigid and self-contained expression of the SCOAI pattern.",
      "His dialogue is calm, deliberate, and authoritative, signaling a personality that operates from complete internal certainty",
      "Extreme Social (S) score reflects his absolute presence; when he speaks, he commands the space.",
      "Extreme Calm (C) indicates his status as he rarely shouts; he speaks with a terrifying, low-volume detachment.",
      "His Extreme Accommodating (A) score captures his performative politeness",
      "He is highly Inquisitive (I) and Organized (O), representing a villain who has researched and planned with academic precision.",
      "Unlike Bellatrix, he does not display enthusiasm; unlike Snape, he does not suppress internal conflict because conflict is absent.",
      "In the films, Voldemort acts without hesitation or emotional disruption.",
      "His openness manifests as strategic foresight rather than curiosity, and his discipline enables long-term planning without moral friction.",
      "His emotional control is not restraint but detachment, allowing him to act decisively without relational or ethical interference.",
      "He embodies ideological agency stripped of doubt"
    ]
  },
  "Albus Dumbledore": {
    "sloan": "SCoAI",
    "tagline": "Agentic, steady",
    "points": [
      "His dialogue is calm, reflective, and often indirect, suggesting confidence that does not require enforcement",
      "Nearly a match for Voldemort, with one crucial difference: organized (o).",
      "While Voldemort and Snape are rigid and meticulous, Dumbledore's movie dialogue is more flexible.",
      "His Extreme Inquisitive (I) and Accommodating (A) scores define him as the wise mentor who values curiosity and social harmony over plain dominance.",
      "Unlike Voldemort, he tolerates ambiguity; unlike Snape, he allows emotional connection; unlike Bellatrix, he does not seek expression through intensity",
      "Dumbledore's authority emerges from trust and perspective rather than control",
      "His openness allows him to consider multiple outcomes, while his emotional stability enables patience.",
      "He shapes events through guidance rather than imposition, making his ideological power relational rather than absolutist.'}",
      "}"
    ]
  }
}